---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.SystemType
source: html/79b1cf49-81c6-43b5-391c-a3c29f84edd8.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.SystemType Property

The Electrical System Type of the Electrical System.

## Syntax (C#)
```csharp
public ElectricalSystemType SystemType { get; }
```

## Remarks
This property is used to retrieve the Electrical System Type of the Electrical System.